{
    "BA": {
        "name": "Batting Average",
        "definition": "Batting average measures the percentage of a batter's at-bats that result in a hit. MLR Reference requires players to have 2 PA per team game to qualify for the leaderboards.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">BA = Hits / At Bats</div>"
            }
        ]
    },
    "OBP": {
        "name": "On-Base Percentage",
        "definition": "On-base percentage measures the percentage of a batter's plate appearances that result in the player reaching base. This includes hits and walks, but does not include reaching on a fielder's choice (which only happens in very rare situations in MLR).",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\"> (Hits + Walks) / (At Bats + Walks + Sacrifice Flies)</div>"
            }
        ]
    },
    "SLG": {
        "name": "Slugging Percentage",
        "definition": "Slugging percentage measures a hitter's power by weighting hits based on the number of bases. A double is worth twice as much as a single, a triple three times, and a home run four times. Slugging percentage can be interpreted as the average number of total bases a player records in an at-bat.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">SLG = Total Bases / At Bats</div>"
            }
        ]
    },
    "OPS": {
        "name": "On-Base Plus Slugging",
        "definition": "OPS is a combination of On-Base Percentage (OBP) and Slugging Percentage (SLG). It is intended to combine a hitter's ability to get on base with their ability to hit for power into a single metric.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">OPS = On-Base Percentage + Slugging Percentage</div>"
            }
        ]
    },
    "ISO": {
        "name": "Isolated Power",
        "definition": "ISO measures a hitter's raw power by calculating their extra bases per at-bat. It is the difference between Slugging Percentage and Batting Average.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">ISO = Slugging Percentage - Batting Average</div>"
            }
        ]
    },
    "BABIP": {
        "name": "Batting Average on Balls In Play",
        "definition": "BABIP measures a player's batting average exclusively on balls they hit into the field of play, excluding home runs and strikeouts. Because MLR has no fielding component, BABIP is not a very meaningful metric.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">BABIP = (Hits - Home Runs) / (At Bats - Strikeouts - Home Runs + Sacrifice Flies)</div>"
            }
        ]
    },
    "WPA": {
        "name": "Win Probability Added",
        "definition": "WPA measures a player's contribution to their team's win probability. It credits or debits a player for how much their action in a plate appearance changed the likelihood of their team winning the game. WPA is taken directly from the gamelogs. WPA is treated as a zero-sum game, where a credit to a batter will identically be debited to the pitcher and vice versa."
    },
    "RE24": {
        "name": "Run Expectancy Over 24 Base-Out States",
        "definition": "<p>RE24 is an advanced statistic that measures the total impact a player has on their team's run-scoring potential. It calculates the change in run expectancy from the beginning of a plate appearance (or stolen base attempt) to the end, crediting or debiting the player for the outcome.</p><p>Unlike stats that only measure hits or outs, RE24 captures the full context of a play. For example, a solo home run is good, but a bases-clearing double that doesn't score the batter is often more valuable in a given situation. RE24 quantifies this value.</p><br>",
        "sections": [
            {
                "title": "Interpretation",
                "content": "<p>RE24 is a counting stat, not a rate stat. It accumulates over a season.</p><ul><li><strong>For Hitters:</strong> A <strong>higher</strong> RE24 is better. It means the player consistently creates situations that lead to more runs. A positive value indicates they have been more productive than an average player would have been in the same situations.</li><li><strong>For Pitchers:</strong> A <strong>lower</strong> RE24 is better. It means the pitcher consistently reduces the opponent's chances of scoring. A negative value indicates the pitcher has been more effective at suppressing run-scoring opportunities than an average pitcher.</li></ul><p>A value of <strong>0</strong> represents a league-average performance.<p><br>"
            },
            {
                "title": "Calculation in MLR",
                "content": "<p>The formula for a single play is:</p><p><div class=\"equation\">RE24 = (Run Expectancy After Play) - (Run Expectancy Before Play) + (Runs Scored on Play)</div></p><p>The calculation process in this tool is as follows:</p><ol><li><strong>Run Expectancy (RE) Matrix:</strong> First, the tool calculates a Run Expectancy Matrix for each season. This matrix contains the average number of runs that will be scored from every possible base-out state (e.g., \"runner on 1st, 0 outs\") until the end of the inning. There are 24 possible states (8 base states x 3 out states). The Run Expectancy Matrix is calculated empirically from all innings in a season. Because of this, the matrix can and will change over the course of the season, and is likely to be inaccurate early in a season. Also, a player's RE24 may change without a player recording another plate appearance (or stolen base attempt) or batter faced.</li><li><strong>Before and After States:</strong> For every single plate appearance in the season, the tool looks at the base-out state <em>before</em> the play and the state <em>after</em> the play.</li><li><strong>Applying the Formula:</strong> The tool retrieves the RE values for the before and after states from the matrix and applies the formula above. Any runs that score directly on the play are also added.</li><li><strong>Aggregation:</strong> A player's seasonal RE24 is the sum of the RE24 values from all of their plate appearances (or stolen base attempts).</li></ol><br>"
            },
            {
                "title": "Run Expectancy Matrix (S12)",
                "content": "<table class='stats-table re-matrix'><thead><tr><th>Outs</th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"none\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th><th><svg width=\"24\" height=\"24\" viewbox=\"0 0 24 24\"><polygon points=\"12,2 17,7 12,12 7,7\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"5,9 10,14 5,19 0,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/><polygon points=\"19,9 24,14 19,19 14,14\" fill=\"#D7DADC\" stroke=\"#D7DADC\" stroke-width=\"1.5\"/></svg></th></tr></thead><tbody><tr><td><strong>0</strong></td><td>0.764</td><td>1.636</td><td>2.647</td><td>1.333</td><td>3.857</td><td>2.500</td><td>2.200</td><td>6.625</td></tr><tr><td><strong>1</strong></td><td>0.333</td><td>0.455</td><td>0.722</td><td>1.571</td><td>1.000</td><td>2.000</td><td>1.250</td><td>2.000</td></tr><tr><td><strong>2</strong></td><td>0.172</td><td>0.442</td><td>0.655</td><td>0.500</td><td>0.600</td><td>1.200</td><td>0.000</td><td>3.000</td></tr></tbody></table>"
            }
        ]
    },
    "WAR": {
        "name": "Wins Above Replacement",
        "definition": "<p>Wins Above Replacement (WAR or cheWAR) is a comprehensive statistic that attempts to consolidate a player's total contribution into a single number. In general, it represents how many more wins a player is worth than a \"replacement-level\" player, a hypothetical, readily-available player (e.g., a minor leaguer) who could be substituted at minimal cost.</p><p>Unlike traditional WAR models (like those from FanGraphs or Baseball-Reference), cheWAR is <i>not</i> context-neutral. Instead, it is directly based on RE24, meaning it inherently reflects the context of each play. While traditional WAR often seeks to answer 'Who is the best player?', cheWAR aims to answer 'Who is the most valuable player?' by quantifying their impact on run expectancy in specific game situations. MLR already has a stat for measuring who the best player is: Average Difference.</p><p>MLR does not have a fielding component, so a player's value solely lies in how good a player is at producing or preventing runs.</p><br>",
        "sections": [
            {
                "title": "Interpretation",
                "content": "<p>WAR provides a convenient way to compare the total value of all players, regardless of whether they are a hitter or a pitcher.</p><ul><li><strong>0.0 WAR:</strong> A replacement-level player.</li><li><strong>0.2 WAR:</strong> A solid, everyday player.</li><li><strong>0.6+ WAR:</strong> An All-Star caliber player.</li><li><strong>1.0+ WAR:</strong> An MVP candidate.</li></ul><p>Since this is a counting stat, these values are benchmarks for a full season. A player's WAR accumulates over time.</p><p>Due to the nature of MLR, pitchers tend to accumulate WAR at a different rate than hitters. As a general rule of thumb, a pitcher often needs approximately double the WAR of a hitter to be considered in the same tier for All-Star or end-of-season award consideration.</p><br>"
            },
            {
                "title": "Calculation in MLR",
                "content": "<p>The WAR model in this tool is designed to be balanced and context-neutral.</p><p><div class=\"equation\">WAR = (Runs Above Replacement) / (Runs Per Win)</div></p><p>Here is the step-by-step process for a given season:</p><ol><li><strong>Total WAR Pool:</strong> The total amount of WAR available for all players in the league for a season is defined as <strong>(Number of Regular Season Games) * 0.41</strong>. For recent seasons, the number of regular season games is 16 sessions * 15 games/session = 240 games, so the total WAR pool is <strong>98.4 WAR</strong>. This aligns with MLB, which has approximately 1000 WAR available for a full season.</li><li><strong>Hitter/Pitcher Split:</strong> To ensure fair comparison, this total WAR pool is split evenly, with 50% allocated to all hitters and 50% to all pitchers.</li><li><strong>Runs Per Win (RPW):</strong> A standard value of <strong>10 Runs Per Win</strong> is used. This means for every 10 runs a player creates above a replacement player, they are credited with 1 WAR.</li><li><strong>Runs Above Replacement (RAR):</strong> This is the core of the calculation.<ul><li>First, a player's <strong>Runs Above Average (RAA)</strong> is their `RE24` for the season.</li><li>Next, a \"replacement-level\" run value is calculated based on the total WAR pool and total playing time (Plate Appearances and Batters Faced) in the league.</li><li>A player's RAR is their `RAA` plus the replacement-level value scaled by their specific playing time.</li><li><div class=\"equation\">RAR = RE24 + (Replacement Value per PA/BF * Player's PA/BF)</div></li></ul></li><li><strong>Final Value:</strong> The player's total RAR is divided by 10 (the RPW value) to arrive at their final WAR for the season.</li></ol><p>For more information on calculating WAR using RE24, you can refer to this FanGraphs article: <a href=\"https://blogs.fangraphs.com/calculating-war-using-re24/\" target=\"_blank\"><u>Calculating WAR Using RE24</u></a></p>"
            }
        ]
    },
    "OPS+": {
        "name": "On-base Plus Slugging Plus",
        "definition": "OPS+ is an advanced statistic that measures a hitter's total offensive value, adjusted for the overall offensive context of the league in a given season. It normalizes a player's On-base Plus Slugging (OPS) so that 100 is always the league average.",
        "sections": [
            {
                "title": "Interpretation",
                "content": "<ul><li><strong>100:</strong> Exactly league average.</li><li><strong>150:</strong> 50% better than the league average hitter.</li><li><strong>75:</strong> 25% worse than the league average hitter.</li></ul><p>OPS+ is a great way to compare players across different seasons and ballparks, as it accounts for variations in both league-wide offensive performance and park effects.</p><br>"
            },
            {
                "title": "Calculation in MLR",
                "content": "<p>The formula used for OPS+ in this tool is:</p><p><div class=\"equation\">OPS+ = 100 * ( (Player's Park-Neutral OBP / League's Park-Neutral OBP) + (Player's Park-Neutral SLG / League's Park-Neutral SLG) - 1 )</div></p><p>To achieve a park-neutral statistic, the calculation uses the <strong>'Result at Neutral'</strong> column for seasons where it is available (S3 and later). This column shows what the outcome of the play would have been in a perfectly average ballpark.</p><p>This approach ensures that OPS+ correctly compares players by adjusting for both league-wide offensive trends and ballpark effects.</p><p><strong>Career OPS+</strong> is calculated using the same logic, but with the player's career park-neutral OBP and SLG measured against a career league-average OBP and SLG (weighted by the player's plate appearances in each season). This ensures a more accurate reflection of career value than averaging seasonal OPS+ values.</p>"
            }
        ]
    },
    "W": {
        "name": "Win",
        "definition": "A single pitcher on the winning team is awarded a Win.",
        "conditional_rules": [
            "<strong>Case 1: Starting Pitcher Earns the Win</strong><br>To qualify for the Win, a starting pitcher must pitch at least <strong>3 and 1/3 innings</strong>, which is scaled from MLB's requirement of pitching 5 innings in a 9 inning game.<br>Their team must have the lead when the pitcher leaves the game.<br>That lead must never be given up for the rest of the game.",
            "<strong>Case 2: Relief Pitcher Earns the Win (Starter Doesn't Qualify)</strong><br>The starting pitcher pitches <strong>less than 3 and 1/3 innings</strong>.<br>The team has the lead when the starter leaves, and they never give it up.<br>The win is awarded to the <strong>first relief pitcher to record at least one out</strong>.",
            "<strong>Case 3: Relief Pitcher Earns the Win (Lead Change)</strong><br>The game is tied or the pitcher's team is behind when they are in the game.<br>While that pitcher is still the pitcher of record, their team takes the lead.<br>The team never gives up that lead."
        ]
    },
    "L": {
        "name": "Loss",
        "definition": "A single pitcher on the losing team is awarded a Loss.",
        "conditional_rules": [
            "<strong>Case 1: Pitcher Allows the Go-Ahead Run</strong><br>A pitcher allows one or more runs to score, which gives the opposing team a lead.<br>The opposing team never gives up that lead for the rest of the game.<br>This pitcher is charged with the loss.",
            "<strong>Case 2: Pitcher Leaves Runners on Base</strong><br>A pitcher leaves the game with one or more runners on base.<br>Those runners later score, and one of them is the run that gives the opposing team a lead they never give up.<br>The pitcher who allowed those runners to get on base is charged with the loss."
        ]
    },
    "SV": {
        "name": "Save",
        "definition": "A single relief pitcher on the winning team can be awarded a Save. The pitcher who gets the Save cannot also get the Win.",
        "conditional_rules": [
            "<strong>Case 1: The \"Standard\" Save</strong><br>The pitcher is the <em>final</em> pitcher for the winning team.<br>They enter the game with a lead of <strong>3 runs or less</strong>.<br>They pitch for at least <strong>1 full inning</strong>.",
            "<strong>Case 2: The \"Tying Run\" Save</strong><br>The pitcher is the <em>final</em> pitcher for the winning team.<br>They enter the game with the potential tying run already on base, at bat, or on the on-deck circle.",
            "<strong>Case 3: The \"Long Relief\" Save</strong><br>The pitcher is the <em>final</em> pitcher for the winning team.<br>They pitch for at least <strong>3 innings</strong> to finish the game. Due to MLR only having 6 inning games, this type of save is exceptionally rare."
        ]
    },
    "HLD": {
        "name": "Hold",
        "definition": "One or more relief pitchers can be awarded a Hold in a game. A pitcher cannot get a Win or a Save in the same game as a Hold.",
        "conditional_rules": [
            "A relief pitcher enters the game in a \"save situation\" (see the glossary entry for 'SV').<br>They record at least one out.<br>They leave the game with their team still in the lead."
        ]
    },
    "ERA": {
        "name": "Earned Run Average",
        "definition": "The average number of earned runs a pitcher allows per six innings pitched. It is the most common statistic for evaluating a pitcher's performance.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">ERA = (Earned Runs * 6) / Innings Pitched</div>"
            }
        ]
    },
    "WHIP": {
        "name": "Walks and Hits per Inning Pitched",
        "definition": "WHIP measures how many baserunners a pitcher allows per inning pitched.",
        "sections": [
            {
                "title": "Calculation",
                "content": "<p>The formula is:</p><div class=\"equation\">WHIP = (Walks + Hits) / Innings Pitched</div>"
            }
        ]
    },
    "FIP": {
        "name": "Fielding Independent Pitching",
        "definition": "Fielding Independent Pitching (FIP) is an advanced pitching metric that estimates a pitcher's performance based only on outcomes that do not involve the defense: home runs, walks, and strikeouts. It operates on the same scale as ERA, making it easy to compare. Because MLR does not have a fielding component, FIP is not a very meaningful stat.",
        "sections": [
            {
                "title": "Interpretation",
                "content": "<p>Because FIP is on the same scale as ERA, you can read it in the same way. A FIP of 3.50 is roughly equivalent to a 3.50 ERA. The key difference is that FIP measures what a pitcher's ERA <em>should have been</em>, given their performance on events they can control.</p><ul><li><strong>If FIP < ERA:</strong> The pitcher may have been unlucky or had poor defensive support.</li><li><strong>If FIP > ERA:</strong> The pitcher may have been lucky or had excellent defensive support.</li></ul><br>"
            },
            {
                "title": "Calculation in MLR",
                "content": "<p>The formula used for FIP in this tool is:</p><p><div class=\"equation\">FIP = ((13 * HR) + (3 * BB) - (2 * K)) / IP + FIP Constant</div></p><ul><li><strong>HR:</strong> Home Runs Allowed</li><li><strong>BB:</strong> Walks Allowed (does not include Hit By Pitch, as HBP is not tracked)</li><li><strong>K:</strong> Strikeouts</li><li><strong>IP:</strong> Innings Pitched</li></ul><p>To ensure FIP is on the same scale as ERA, a <strong>FIP Constant</strong> is calculated for each season and added. This constant is derived from the league's overall performance in a given season:</p><p><div class=\"equation\">FIP Constant = League ERA - ((13 * League HR) + (3 * League BB) - (2 * League K)) / League IP</div></p><p>This adjustment ensures that a league-average FIP will equal the league-average ERA for that season, making for a fair comparison.</p>"
            }
        ]
    },
    "ERA-": {
        "name": "Earned Run Average Minus",
        "definition": "ERA- is an advanced statistic that measures a pitcher's performance, adjusted for the overall offensive context of the league and park in a given season. It normalizes a pitcher's Earned Run Average (ERA) so that 100 is always the league average, and unlike traditional ERA, a lower number is better.",
        "sections": [
            {
                "title": "Interpretation",
                "content": "<ul><li><strong>100:</strong> Exactly league average.</li><li><strong>50:</strong> 50% better than the league average pitcher.</li><li><strong>125:</strong> 25% worse than the league average pitcher.</li></ul><p>ERA- is the pitching equivalent of OPS+ and is one of the best ways to compare pitchers across different eras, seasons, and ballparks.</p><br>"
            },
            {
                "title": "Why ERA-?",
                "content": "<p>ERA- and ERA+ both aim to solve the same problem: adjusting a pitcher's ERA for external factors like league-wide offensive performance and ballpark effects. However, they present the information in slightly different ways.</p><p><strong>ERA+</strong> sets the league average at 100, and a higher score is better. ERA+ compares <strong>the league ERA to the pitcher's ERA</strong>. An ERA+ of 150 means the league average is 50% worse than the pitcher.</p><p><strong>ERA-</strong> also sets the league average at 100, but a lower score is better. ERA- compares <strong>the pitcher's ERA to the league ERA</strong>. An ERA- of 150 means a pitcher is 50% worse than the league average.</p><p>ERA- is often considered more intuitive because it aligns with the scale of ERA itself, where lower numbers are better. The other advantage of ERA- is how the comparison is made. An ERA- of 75 means a player's ERA is 25% lower than average. An ERA+ of 125 means the average ERA is 25% higher than the player's, which means the player's ERA is only 20% lower than average. This interpretation is not as intuitive.</p><p>For more information on the difference between ERA+ and ERA-, refer to this article: <a href=\"https://www.beyondtheboxscore.com/2012/9/14/3332194/era-plus-vs-era-minus\" target=\"_blank\"><u>ERA+ Vs. ERA-</u></a></p><br>"
            },
            {
                "title": "Calculation in MLR",
                "content": "<p>The formula used for ERA- in this tool is:</p><p><div class=\"equation\">ERA- = 100 * (Player's Park-Neutral ERA / League's Park-Neutral ERA)</div></p><p>Calculating a pitcher's Park-Neutral ERA (`nERA`) is a complex process:</p><ol><li><strong>Neutral Simulation:</strong> Each inning a pitcher has thrown is re-simulated using the <strong>'Result at Neutral'</strong> to determine what would have happened in an average ballpark.</li><li><strong>Inherited Runner Accountability:</strong> The simulation is careful to only hold pitchers accountable for runners they put on base. Runs scored by inherited runners are not counted against a pitcher's `nERA`.</li><li><strong>Responsibility for Runners Left on Base:</strong> When a pitcher exits mid-inning, they are still responsible for the runners they leave behind. To account for this, the simulation uses the <strong>Run Expectancy (RE) Matrix)</strong> to calculate the probable number of runs that will score. It intelligently separates the run expectancy of inherited runners from the pitcher's own runners, ensuring the pitcher is only charged for the run potential they created.</li></ol><p>This comprehensive simulation produces a pitcher's `nERA`, which reflects their performance independent of park effects. This `nERA` is then compared against the league-average `nERA` to produce the final ERA-.</p><p><strong>Career ERA-</strong> is calculated using the same logic, but with the player's career park-neutral ERA (`nERA`) measured against a career league-average `nERA` (weighted by the player's innings pitched in each season). This provides a more accurate career value than averaging seasonal ERA- values.</p>"
            }
        ]
    }
}